// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Impostazioni server proxy";
HSDTaskDescription = "La stampante supporta la connessione a Internet. Se si utilizza un server proxy per la connessione a Internet, configurare le impostazioni riportate sotto.";
TaskDescriptionInAssistantMode = "Per connettersi ad HP Web Services, la stampante deve essere in grado di connettersi a Internet. Se per la connessione Internet si utilizza un server proxy, specificare le impostazioni sotto riportate.\n\nSe non si conoscono le impostazioni del proprio server proxy, fare riferimento al finestra delle preferenze di rete oppure contattare l'amministratore del sistema.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Il server proxy non è necessario per l'accesso a Internet";
HSDAutomaticProxySettingsTitle = "Automatica (il dispositivo rileva automaticamente le impostazioni)";
HSDCustomProxySettingsTitle = "Configurazione personalizzata del server proxy:";
HSDSystemProxySettingsTitle = "Copia impostazioni sistema";

// Proxy server settings
HSDProxyServerTitle = "Server proxy:";
ProxyPortTitle = "Porta proxy";

// Authentication
HSDRequiresAuthenticationButton = "Il server proxy richiede l'autenticazione";
HSDUserNameTitle = "Nome utente:";
HSDPasswordTitle = "Password:";

HSDApplyNowButtonTitle = "Applica";

// progress titles
UpdateInformationProcessTitle = "Aggiornamento informazioni in corso...";

// alerts
EmptyProxyServerOrPortErrorText = "Occorre specificare il server proxy e la porta proxy.";

EmptyUserNameOrPasswordErrorText = "L'autenticazione del server proxy richiede l'immissione del nome utente e della password.";

IncorrectProxyServerNameFormatErrorText = "Impossibile impostare il nome del server proxy. Verificare che il formato sia valido.";

HSDUserNameTooLargeErrorText = "Il nome utente è troppo lungo. Il dispositivo supporta un massimo di %d caratteri per il nome utente.";
